name: "CIFAR10_full"
layer {
  name: "cifar"
  type: "Data"
  top: "data/cifar"
  data_param {
    source: "../cifar_hash_dataset/cifar_triplet_train_lvdb"
    batch_size: 100
  }
  transform_param {
    mean_file: "../cifar_hash_dataset/cifar_triplet_mean.bin" 
  }
  include: { phase: TRAIN }
}


#--- Slice ---#

layer {name: "slice_triplet" type: "Slice" bottom: "data/cifar"
       top: "data" top: "data_2" top: "data_3"
       slice_param {slice_dim: 1 slice_point: 3 slice_point:6}}

#--- Stream 1---#

layer {
  name: "conv1/cifar"
  type: "Convolution"
  bottom: "data_2"
  top: "conv1/cifar"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1/cifar"
  type: "ReLU"
  bottom: "conv1/cifar"
  top: "conv1/cifar"
}
layer {
  name: "cccp1/cifar"
  type: "Convolution"
  bottom: "conv1/cifar"
  top: "cccp1/cifar"
  param {
    name: "cccp1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2/cifar"
  type: "ReLU"
  bottom: "cccp1/cifar"
  top: "cccp1/cifar"
}
layer {
  name: "pool1/cifar"
  type: "Pooling"
  bottom: "cccp1/cifar"
  top: "pool1/cifar"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "drop1/cifar"
  type: "Dropout"
  bottom: "pool1/cifar"
  top: "pool1/cifar"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "conv2/cifar"
  type: "Convolution"
  bottom: "pool1/cifar"
  top: "conv2/cifar"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4/cifar"
  type: "ReLU"
  bottom: "conv2/cifar"
  top: "conv2/cifar"
}
layer {
  name: "cccp3/cifar"
  type: "Convolution"
  bottom: "conv2/cifar"
  top: "cccp3/cifar"
  param {
    name: "cccp3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5/cifar"
  type: "ReLU"
  bottom: "cccp3/cifar"
  top: "cccp3/cifar"
}
layer {
  name: "pool2/cifar"
  type: "Pooling"
  bottom: "cccp3/cifar"
  top: "pool2/cifar"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3/cifar"
  type: "Convolution"
  bottom: "pool2/cifar"
  top: "conv3/cifar"
  param {
    name: "conv3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    #pad: 1
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7/cifar"
  type: "ReLU"
  bottom: "conv3/cifar"
  top: "conv3/cifar"
}
layer {
  name: "cccp5/cifar"
  type: "Convolution"
  bottom: "conv3/cifar"
  top: "cccp5/cifar"
  param {
    name: "cccp5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu8/cifar"
  type: "ReLU"
  bottom: "cccp5/cifar"
  top: "cccp5/cifar"
}
layer {
  name: "pool3/cifar"
  type: "Pooling"
  bottom: "cccp5/cifar"
  top: "pool3/cifar"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "drop3/cifar"
  type: "Dropout"
  bottom: "pool3/cifar"
  top: "pool3/cifar"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "conv4/cifar"
  type: "Convolution"
  bottom: "pool3/cifar"
  top: "conv4/cifar"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu10/cifar"
  type: "ReLU"
  bottom: "conv4/cifar"
  top: "conv4/cifar"
}
layer {
  name: "cccp7/cifar"
  type: "Convolution"
  bottom: "conv4/cifar"
  top: "cccp7/cifar"
  param {
    name: "cccp7_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp7_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2400
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu11/cifar"
  type: "ReLU"
  bottom: "cccp7/cifar"
  top: "cccp7/cifar"
}
layer {
  name: "pool4/cifar"
  type: "Pooling"
  bottom: "cccp7/cifar"
  top: "pool4/cifar"
  pooling_param {
    pool: AVE
    kernel_size: 4
    stride: 1
  }
}

layer {
  name: "split_pair_s/cifar"
  type: "Slice"
  bottom: "pool4/cifar"
  top: "slice_s1/cifar"
  top: "slice_s2/cifar"
  top: "slice_s3/cifar"
  top: "slice_s4/cifar"
  top: "slice_s5/cifar"
  top: "slice_s6/cifar"
  top: "slice_s7/cifar"
  top: "slice_s8/cifar"
  top: "slice_s9/cifar"
  top: "slice_s10/cifar"
  top: "slice_s11/cifar"
  top: "slice_s12/cifar"
  top: "slice_s13/cifar"
  top: "slice_s14/cifar"
  top: "slice_s15/cifar"
  top: "slice_s16/cifar"
  top: "slice_s17/cifar"
  top: "slice_s18/cifar"
  top: "slice_s19/cifar"
  top: "slice_s20/cifar"
  top: "slice_s21/cifar"
  top: "slice_s22/cifar"
  top: "slice_s23/cifar"
  top: "slice_s24/cifar"
  top: "slice_s25/cifar"
  top: "slice_s26/cifar"
  top: "slice_s27/cifar"
  top: "slice_s28/cifar"
  top: "slice_s29/cifar"
  top: "slice_s30/cifar"
  top: "slice_s31/cifar"
  top: "slice_s32/cifar"
  top: "slice_s33/cifar"
  top: "slice_s34/cifar"
  top: "slice_s35/cifar"
  top: "slice_s36/cifar"
  top: "slice_s37/cifar"
  top: "slice_s38/cifar"
  top: "slice_s39/cifar"
  top: "slice_s40/cifar"
  top: "slice_s41/cifar"
  top: "slice_s42/cifar"
  top: "slice_s43/cifar"
  top: "slice_s44/cifar"
  top: "slice_s45/cifar"
  top: "slice_s46/cifar"
  top: "slice_s47/cifar"
  top: "slice_s48/cifar"
  slice_param {
    slice_dim: 1
    slice_point: 50
    slice_point: 100
    slice_point: 150
    slice_point: 200
    slice_point: 250
    slice_point: 300
    slice_point: 350
    slice_point: 400
    slice_point: 450
    slice_point: 500
    slice_point: 550
    slice_point: 600
    slice_point: 650
    slice_point: 700
    slice_point: 750
    slice_point: 800
    slice_point: 850
    slice_point: 900
    slice_point: 950
    slice_point: 1000
    slice_point: 1050
    slice_point: 1100
    slice_point: 1150
    slice_point: 1200
    slice_point: 1250
    slice_point: 1300
    slice_point: 1350
    slice_point: 1400
    slice_point: 1450
    slice_point: 1500
    slice_point: 1550
    slice_point: 1600
    slice_point: 1650
    slice_point: 1700
    slice_point: 1750
    slice_point: 1800
    slice_point: 1850
    slice_point: 1900
    slice_point: 1950
    slice_point: 2000
    slice_point: 2050
    slice_point: 2100
    slice_point: 2150
    slice_point: 2200
    slice_point: 2250
    slice_point: 2300
    slice_point: 2350
  }
}
layer {
  name: "ip_s1/cifar"
  type: "InnerProduct"
  bottom: "slice_s1/cifar"
  top: "hash_s1/cifar"
  param {
    name: "ip_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s1/cifar"
  type: "Sigmoid"
  bottom: "hash_s1/cifar"
  top: "hash_s1/cifar"
}

layer {
  name: "ip_s2/cifar"
  type: "InnerProduct"
  bottom: "slice_s2/cifar"
  top: "hash_s2/cifar"
  param {
    name: "ip_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s2/cifar"
  type: "Sigmoid"
  bottom: "hash_s2/cifar"
  top: "hash_s2/cifar"
}

layer {
  name: "ip_s3/cifar"
  type: "InnerProduct"
  bottom: "slice_s3/cifar"
  top: "hash_s3/cifar"
  param {
    name: "ip_3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s3/cifar"
  type: "Sigmoid"
  bottom: "hash_s3/cifar"
  top: "hash_s3/cifar"
}

layer {
  name: "ip_s4/cifar"
  type: "InnerProduct"
  bottom: "slice_s4/cifar"
  top: "hash_s4/cifar"
  param {
    name: "ip_4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_4_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s4/cifar"
  type: "Sigmoid"
  bottom: "hash_s4/cifar"
  top: "hash_s4/cifar"
}

layer {
  name: "ip_s5/cifar"
  type: "InnerProduct"
  bottom: "slice_s5/cifar"
  top: "hash_s5/cifar"
  param {
    name: "ip_5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_5_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s5/cifar"
  type: "Sigmoid"
  bottom: "hash_s5/cifar"
  top: "hash_s5/cifar"
}

layer {
  name: "ip_s6/cifar"
  type: "InnerProduct"
  bottom: "slice_s6/cifar"
  top: "hash_s6/cifar"
  param {
    name: "ip_6_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_6_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s6/cifar"
  type: "Sigmoid"
  bottom: "hash_s6/cifar"
  top: "hash_s6/cifar"
}

layer {
  name: "ip_s7/cifar"
  type: "InnerProduct"
  bottom: "slice_s7/cifar"
  top: "hash_s7/cifar"
  param {
    name: "ip_7_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_7_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s7/cifar"
  type: "Sigmoid"
  bottom: "hash_s7/cifar"
  top: "hash_s7/cifar"
}

layer {
  name: "ip_s8/cifar"
  type: "InnerProduct"
  bottom: "slice_s8/cifar"
  top: "hash_s8/cifar"
  param {
    name: "ip_8_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_8_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s8/cifar"
  type: "Sigmoid"
  bottom: "hash_s8/cifar"
  top: "hash_s8/cifar"
}

layer {
  name: "ip_s9/cifar"
  type: "InnerProduct"
  bottom: "slice_s9/cifar"
  top: "hash_s9/cifar"
  param {
    name: "ip_9_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_9_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s9/cifar"
  type: "Sigmoid"
  bottom: "hash_s9/cifar"
  top: "hash_s9/cifar"
}

layer {
  name: "ip_s10/cifar"
  type: "InnerProduct"
  bottom: "slice_s10/cifar"
  top: "hash_s10/cifar"
  param {
    name: "ip_10_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_10_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s10/cifar"
  type: "Sigmoid"
  bottom: "hash_s10/cifar"
  top: "hash_s10/cifar"
}

layer {
  name: "ip_s11/cifar"
  type: "InnerProduct"
  bottom: "slice_s11/cifar"
  top: "hash_s11/cifar"
  param {
    name: "ip_11_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_11_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s11/cifar"
  type: "Sigmoid"
  bottom: "hash_s11/cifar"
  top: "hash_s11/cifar"
}

layer {
  name: "ip_s12/cifar"
  type: "InnerProduct"
  bottom: "slice_s12/cifar"
  top: "hash_s12/cifar"
  param {
    name: "ip_12_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_12_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s12/cifar"
  type: "Sigmoid"
  bottom: "hash_s12/cifar"
  top: "hash_s12/cifar"
}

layer {
  name: "ip_s13/cifar"
  type: "InnerProduct"
  bottom: "slice_s13/cifar"
  top: "hash_s13/cifar"
  param {
    name: "ip_13_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_13_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s13/cifar"
  type: "Sigmoid"
  bottom: "hash_s13/cifar"
  top: "hash_s13/cifar"
}

layer {
  name: "ip_s14/cifar"
  type: "InnerProduct"
  bottom: "slice_s14/cifar"
  top: "hash_s14/cifar"
  param {
    name: "ip_14_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_14_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s14/cifar"
  type: "Sigmoid"
  bottom: "hash_s14/cifar"
  top: "hash_s14/cifar"
}

layer {
  name: "ip_s15/cifar"
  type: "InnerProduct"
  bottom: "slice_s15/cifar"
  top: "hash_s15/cifar"
  param {
    name: "ip_15_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_15_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s15/cifar"
  type: "Sigmoid"
  bottom: "hash_s15/cifar"
  top: "hash_s15/cifar"
}

layer {
  name: "ip_s16/cifar"
  type: "InnerProduct"
  bottom: "slice_s16/cifar"
  top: "hash_s16/cifar"
  param {
    name: "ip_16_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_16_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s16/cifar"
  type: "Sigmoid"
  bottom: "hash_s16/cifar"
  top: "hash_s16/cifar"
}

layer {
  name: "ip_s17/cifar"
  type: "InnerProduct"
  bottom: "slice_s17/cifar"
  top: "hash_s17/cifar"
  param {
    name: "ip_17_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_17_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s17/cifar"
  type: "Sigmoid"
  bottom: "hash_s17/cifar"
  top: "hash_s17/cifar"
}

layer {
  name: "ip_s18/cifar"
  type: "InnerProduct"
  bottom: "slice_s18/cifar"
  top: "hash_s18/cifar"
  param {
    name: "ip_18_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_18_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s18/cifar"
  type: "Sigmoid"
  bottom: "hash_s18/cifar"
  top: "hash_s18/cifar"
}

layer {
  name: "ip_s19/cifar"
  type: "InnerProduct"
  bottom: "slice_s19/cifar"
  top: "hash_s19/cifar"
  param {
    name: "ip_19_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_19_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s19/cifar"
  type: "Sigmoid"
  bottom: "hash_s19/cifar"
  top: "hash_s19/cifar"
}

layer {
  name: "ip_s20/cifar"
  type: "InnerProduct"
  bottom: "slice_s20/cifar"
  top: "hash_s20/cifar"
  param {
    name: "ip_20_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_20_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s20/cifar"
  type: "Sigmoid"
  bottom: "hash_s20/cifar"
  top: "hash_s20/cifar"
}

layer {
  name: "ip_s21/cifar"
  type: "InnerProduct"
  bottom: "slice_s21/cifar"
  top: "hash_s21/cifar"
  param {
    name: "ip_21_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_21_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s21/cifar"
  type: "Sigmoid"
  bottom: "hash_s21/cifar"
  top: "hash_s21/cifar"
}

layer {
  name: "ip_s22/cifar"
  type: "InnerProduct"
  bottom: "slice_s22/cifar"
  top: "hash_s22/cifar"
  param {
    name: "ip_22_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_22_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s22/cifar"
  type: "Sigmoid"
  bottom: "hash_s22/cifar"
  top: "hash_s22/cifar"
}

layer {
  name: "ip_s23/cifar"
  type: "InnerProduct"
  bottom: "slice_s23/cifar"
  top: "hash_s23/cifar"
  param {
    name: "ip_23_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_23_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s23/cifar"
  type: "Sigmoid"
  bottom: "hash_s23/cifar"
  top: "hash_s23/cifar"
}

layer {
  name: "ip_s24/cifar"
  type: "InnerProduct"
  bottom: "slice_s24/cifar"
  top: "hash_s24/cifar"
  param {
    name: "ip_24_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_24_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s24/cifar"
  type: "Sigmoid"
  bottom: "hash_s24/cifar"
  top: "hash_s24/cifar"
}

layer {
  name: "ip_s25/cifar"
  type: "InnerProduct"
  bottom: "slice_s25/cifar"
  top: "hash_s25/cifar"
  param {
    name: "ip_25_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_25_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s25/cifar"
  type: "Sigmoid"
  bottom: "hash_s25/cifar"
  top: "hash_s25/cifar"
}

layer {
  name: "ip_s26/cifar"
  type: "InnerProduct"
  bottom: "slice_s26/cifar"
  top: "hash_s26/cifar"
  param {
    name: "ip_26_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_26_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s26/cifar"
  type: "Sigmoid"
  bottom: "hash_s26/cifar"
  top: "hash_s26/cifar"
}

layer {
  name: "ip_s27/cifar"
  type: "InnerProduct"
  bottom: "slice_s27/cifar"
  top: "hash_s27/cifar"
  param {
    name: "ip_27_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_27_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s27/cifar"
  type: "Sigmoid"
  bottom: "hash_s27/cifar"
  top: "hash_s27/cifar"
}

layer {
  name: "ip_s28/cifar"
  type: "InnerProduct"
  bottom: "slice_s28/cifar"
  top: "hash_s28/cifar"
  param {
    name: "ip_28_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_28_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s28/cifar"
  type: "Sigmoid"
  bottom: "hash_s28/cifar"
  top: "hash_s28/cifar"
}

layer {
  name: "ip_s29/cifar"
  type: "InnerProduct"
  bottom: "slice_s29/cifar"
  top: "hash_s29/cifar"
  param {
    name: "ip_29_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_29_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s29/cifar"
  type: "Sigmoid"
  bottom: "hash_s29/cifar"
  top: "hash_s29/cifar"
}

layer {
  name: "ip_s30/cifar"
  type: "InnerProduct"
  bottom: "slice_s30/cifar"
  top: "hash_s30/cifar"
  param {
    name: "ip_30_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_30_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s30/cifar"
  type: "Sigmoid"
  bottom: "hash_s30/cifar"
  top: "hash_s30/cifar"
}

layer {
  name: "ip_s31/cifar"
  type: "InnerProduct"
  bottom: "slice_s31/cifar"
  top: "hash_s31/cifar"
  param {
    name: "ip_31_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_31_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s31/cifar"
  type: "Sigmoid"
  bottom: "hash_s31/cifar"
  top: "hash_s31/cifar"
}

layer {
  name: "ip_s32/cifar"
  type: "InnerProduct"
  bottom: "slice_s32/cifar"
  top: "hash_s32/cifar"
  param {
    name: "ip_32_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_32_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s32/cifar"
  type: "Sigmoid"
  bottom: "hash_s32/cifar"
  top: "hash_s32/cifar"
}

layer {
  name: "ip_s33/cifar"
  type: "InnerProduct"
  bottom: "slice_s33/cifar"
  top: "hash_s33/cifar"
  param {
    name: "ip_33_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_33_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s33/cifar"
  type: "Sigmoid"
  bottom: "hash_s33/cifar"
  top: "hash_s33/cifar"
}

layer {
  name: "ip_s34/cifar"
  type: "InnerProduct"
  bottom: "slice_s34/cifar"
  top: "hash_s34/cifar"
  param {
    name: "ip_34_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_34_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s34/cifar"
  type: "Sigmoid"
  bottom: "hash_s34/cifar"
  top: "hash_s34/cifar"
}

layer {
  name: "ip_s35/cifar"
  type: "InnerProduct"
  bottom: "slice_s35/cifar"
  top: "hash_s35/cifar"
  param {
    name: "ip_35_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_35_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s35/cifar"
  type: "Sigmoid"
  bottom: "hash_s35/cifar"
  top: "hash_s35/cifar"
}

layer {
  name: "ip_s36/cifar"
  type: "InnerProduct"
  bottom: "slice_s36/cifar"
  top: "hash_s36/cifar"
  param {
    name: "ip_36_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_36_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s36/cifar"
  type: "Sigmoid"
  bottom: "hash_s36/cifar"
  top: "hash_s36/cifar"
}

layer {
  name: "ip_s37/cifar"
  type: "InnerProduct"
  bottom: "slice_s37/cifar"
  top: "hash_s37/cifar"
  param {
    name: "ip_37_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_37_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s37/cifar"
  type: "Sigmoid"
  bottom: "hash_s37/cifar"
  top: "hash_s37/cifar"
}

layer {
  name: "ip_s38/cifar"
  type: "InnerProduct"
  bottom: "slice_s38/cifar"
  top: "hash_s38/cifar"
  param {
    name: "ip_38_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_38_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s38/cifar"
  type: "Sigmoid"
  bottom: "hash_s38/cifar"
  top: "hash_s38/cifar"
}

layer {
  name: "ip_s39/cifar"
  type: "InnerProduct"
  bottom: "slice_s39/cifar"
  top: "hash_s39/cifar"
  param {
    name: "ip_39_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_39_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s39/cifar"
  type: "Sigmoid"
  bottom: "hash_s39/cifar"
  top: "hash_s39/cifar"
}

layer {
  name: "ip_s40/cifar"
  type: "InnerProduct"
  bottom: "slice_s40/cifar"
  top: "hash_s40/cifar"
  param {
    name: "ip_40_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_40_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s40/cifar"
  type: "Sigmoid"
  bottom: "hash_s40/cifar"
  top: "hash_s40/cifar"
}

layer {
  name: "ip_s41/cifar"
  type: "InnerProduct"
  bottom: "slice_s41/cifar"
  top: "hash_s41/cifar"
  param {
    name: "ip_41_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_41_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s41/cifar"
  type: "Sigmoid"
  bottom: "hash_s41/cifar"
  top: "hash_s41/cifar"
}

layer {
  name: "ip_s42/cifar"
  type: "InnerProduct"
  bottom: "slice_s42/cifar"
  top: "hash_s42/cifar"
  param {
    name: "ip_42_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_42_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s42/cifar"
  type: "Sigmoid"
  bottom: "hash_s42/cifar"
  top: "hash_s42/cifar"
}

layer {
  name: "ip_s43/cifar"
  type: "InnerProduct"
  bottom: "slice_s43/cifar"
  top: "hash_s43/cifar"
  param {
    name: "ip_43_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_43_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s43/cifar"
  type: "Sigmoid"
  bottom: "hash_s43/cifar"
  top: "hash_s43/cifar"
}

layer {
  name: "ip_s44/cifar"
  type: "InnerProduct"
  bottom: "slice_s44/cifar"
  top: "hash_s44/cifar"
  param {
    name: "ip_44_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_44_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s44/cifar"
  type: "Sigmoid"
  bottom: "hash_s44/cifar"
  top: "hash_s44/cifar"
}

layer {
  name: "ip_s45/cifar"
  type: "InnerProduct"
  bottom: "slice_s45/cifar"
  top: "hash_s45/cifar"
  param {
    name: "ip_45_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_45_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s45/cifar"
  type: "Sigmoid"
  bottom: "hash_s45/cifar"
  top: "hash_s45/cifar"
}

layer {
  name: "ip_s46/cifar"
  type: "InnerProduct"
  bottom: "slice_s46/cifar"
  top: "hash_s46/cifar"
  param {
    name: "ip_46_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_46_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s46/cifar"
  type: "Sigmoid"
  bottom: "hash_s46/cifar"
  top: "hash_s46/cifar"
}

layer {
  name: "ip_s47/cifar"
  type: "InnerProduct"
  bottom: "slice_s47/cifar"
  top: "hash_s47/cifar"
  param {
    name: "ip_47_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_47_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s47/cifar"
  type: "Sigmoid"
  bottom: "hash_s47/cifar"
  top: "hash_s47/cifar"
}

layer {
  name: "ip_s48/cifar"
  type: "InnerProduct"
  bottom: "slice_s48/cifar"
  top: "hash_s48/cifar"
  param {
    name: "ip_48_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_48_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s48/cifar"
  type: "Sigmoid"
  bottom: "hash_s48/cifar"
  top: "hash_s48/cifar"
}



layer {
  name: "concat_pair_s1/cifar"
  type: "Concat"
  bottom: "hash_s1/cifar"
  bottom: "hash_s2/cifar"
  bottom: "hash_s3/cifar"
  bottom: "hash_s4/cifar"
  bottom: "hash_s5/cifar"
  bottom: "hash_s6/cifar"
  bottom: "hash_s7/cifar"
  bottom: "hash_s8/cifar"
  bottom: "hash_s9/cifar"
  bottom: "hash_s10/cifar"
  bottom: "hash_s11/cifar"
  bottom: "hash_s12/cifar"
  bottom: "hash_s13/cifar"
  bottom: "hash_s14/cifar"
  bottom: "hash_s15/cifar"
  bottom: "hash_s16/cifar"
  bottom: "hash_s17/cifar"
  bottom: "hash_s18/cifar"
  bottom: "hash_s19/cifar"
  bottom: "hash_s20/cifar"
  bottom: "hash_s21/cifar"
  bottom: "hash_s22/cifar"
  bottom: "hash_s23/cifar"
  bottom: "hash_s24/cifar"
  bottom: "hash_s25/cifar"
  bottom: "hash_s26/cifar"
  bottom: "hash_s27/cifar"
  bottom: "hash_s28/cifar"
  bottom: "hash_s29/cifar"
  bottom: "hash_s30/cifar"
  bottom: "hash_s31/cifar"
  bottom: "hash_s32/cifar"
  bottom: "hash_s33/cifar"
  bottom: "hash_s34/cifar"
  bottom: "hash_s35/cifar"
  bottom: "hash_s36/cifar"
  bottom: "hash_s37/cifar"
  bottom: "hash_s38/cifar"
  bottom: "hash_s39/cifar"
  bottom: "hash_s40/cifar"
  bottom: "hash_s41/cifar"
  bottom: "hash_s42/cifar"
  bottom: "hash_s43/cifar"
  bottom: "hash_s44/cifar"
  bottom: "hash_s45/cifar"
  bottom: "hash_s46/cifar"
  bottom: "hash_s47/cifar"
  bottom: "hash_s48/cifar"
  top: "concat_s1/cifar"
  concat_param {
    concat_dim: 1
  }
}



#--- Stream 2---#

layer {
  name: "conv1/cifar2"
  type: "Convolution"
  bottom: "data_3"
  top: "conv1/cifar2"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 5
    stride: 1
    pad: 2
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1/cifar2"
  type: "ReLU"
  bottom: "conv1/cifar2"
  top: "conv1/cifar2"
}
layer {
  name: "cccp1/cifar2"
  type: "Convolution"
  bottom: "conv1/cifar2"
  top: "cccp1/cifar2"
  param {
    name: "cccp1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2/cifar2"
  type: "ReLU"
  bottom: "cccp1/cifar2"
  top: "cccp1/cifar2"
}
layer {
  name: "pool1/cifar2"
  type: "Pooling"
  bottom: "cccp1/cifar2"
  top: "pool1/cifar2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "drop1/cifar2"
  type: "Dropout"
  bottom: "pool1/cifar2"
  top: "pool1/cifar2"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "conv2/cifar2"
  type: "Convolution"
  bottom: "pool1/cifar2"
  top: "conv2/cifar2"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4/cifar2"
  type: "ReLU"
  bottom: "conv2/cifar2"
  top: "conv2/cifar2"
}
layer {
  name: "cccp3/cifar2"
  type: "Convolution"
  bottom: "conv2/cifar2"
  top: "cccp3/cifar2"
  param {
    name: "cccp3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5/cifar2"
  type: "ReLU"
  bottom: "cccp3/cifar2"
  top: "cccp3/cifar2"
}
layer {
  name: "pool2/cifar2"
  type: "Pooling"
  bottom: "cccp3/cifar2"
  top: "pool2/cifar2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv3/cifar2"
  type: "Convolution"
  bottom: "pool2/cifar2"
  top: "conv3/cifar2"
  param {
    name: "conv3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    #pad: 1
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7/cifar2"
  type: "ReLU"
  bottom: "conv3/cifar2"
  top: "conv3/cifar2"
}
layer {
  name: "cccp5/cifar2"
  type: "Convolution"
  bottom: "conv3/cifar2"
  top: "cccp5/cifar2"
  param {
    name: "cccp5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu8/cifar2"
  type: "ReLU"
  bottom: "cccp5/cifar2"
  top: "cccp5/cifar2"
}
layer {
  name: "pool3/cifar2"
  type: "Pooling"
  bottom: "cccp5/cifar2"
  top: "pool3/cifar2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "drop3/cifar2"
  type: "Dropout"
  bottom: "pool3/cifar2"
  top: "pool3/cifar2"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "conv4/cifar2"
  type: "Convolution"
  bottom: "pool3/cifar2"
  top: "conv4/cifar2"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu10/cifar2"
  type: "ReLU"
  bottom: "conv4/cifar2"
  top: "conv4/cifar2"
}
layer {
  name: "cccp7/cifar2"
  type: "Convolution"
  bottom: "conv4/cifar2"
  top: "cccp7/cifar2"
  param {
    name: "cccp7_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "cccp7_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 2400
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.05
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu11/cifar2"
  type: "ReLU"
  bottom: "cccp7/cifar2"
  top: "cccp7/cifar2"
}
layer {
  name: "pool4/cifar2"
  type: "Pooling"
  bottom: "cccp7/cifar2"
  top: "pool4/cifar2"
  pooling_param {
    pool: AVE
    kernel_size: 4
    stride: 1
  }
}

layer {
  name: "split_pair_s/cifar2"
  type: "Slice"
  bottom: "pool4/cifar2"
  top: "slice_s1/cifar2"
  top: "slice_s2/cifar2"
  top: "slice_s3/cifar2"
  top: "slice_s4/cifar2"
  top: "slice_s5/cifar2"
  top: "slice_s6/cifar2"
  top: "slice_s7/cifar2"
  top: "slice_s8/cifar2"
  top: "slice_s9/cifar2"
  top: "slice_s10/cifar2"
  top: "slice_s11/cifar2"
  top: "slice_s12/cifar2"
  top: "slice_s13/cifar2"
  top: "slice_s14/cifar2"
  top: "slice_s15/cifar2"
  top: "slice_s16/cifar2"
  top: "slice_s17/cifar2"
  top: "slice_s18/cifar2"
  top: "slice_s19/cifar2"
  top: "slice_s20/cifar2"
  top: "slice_s21/cifar2"
  top: "slice_s22/cifar2"
  top: "slice_s23/cifar2"
  top: "slice_s24/cifar2"
  top: "slice_s25/cifar2"
  top: "slice_s26/cifar2"
  top: "slice_s27/cifar2"
  top: "slice_s28/cifar2"
  top: "slice_s29/cifar2"
  top: "slice_s30/cifar2"
  top: "slice_s31/cifar2"
  top: "slice_s32/cifar2"
  top: "slice_s33/cifar2"
  top: "slice_s34/cifar2"
  top: "slice_s35/cifar2"
  top: "slice_s36/cifar2"
  top: "slice_s37/cifar2"
  top: "slice_s38/cifar2"
  top: "slice_s39/cifar2"
  top: "slice_s40/cifar2"
  top: "slice_s41/cifar2"
  top: "slice_s42/cifar2"
  top: "slice_s43/cifar2"
  top: "slice_s44/cifar2"
  top: "slice_s45/cifar2"
  top: "slice_s46/cifar2"
  top: "slice_s47/cifar2"
  top: "slice_s48/cifar2"
  slice_param {
    slice_dim: 1
    slice_point: 50
    slice_point: 100
    slice_point: 150
    slice_point: 200
    slice_point: 250
    slice_point: 300
    slice_point: 350
    slice_point: 400
    slice_point: 450
    slice_point: 500
    slice_point: 550
    slice_point: 600
    slice_point: 650
    slice_point: 700
    slice_point: 750
    slice_point: 800
    slice_point: 850
    slice_point: 900
    slice_point: 950
    slice_point: 1000
    slice_point: 1050
    slice_point: 1100
    slice_point: 1150
    slice_point: 1200
    slice_point: 1250
    slice_point: 1300
    slice_point: 1350
    slice_point: 1400
    slice_point: 1450
    slice_point: 1500
    slice_point: 1550
    slice_point: 1600
    slice_point: 1650
    slice_point: 1700
    slice_point: 1750
    slice_point: 1800
    slice_point: 1850
    slice_point: 1900
    slice_point: 1950
    slice_point: 2000
    slice_point: 2050
    slice_point: 2100
    slice_point: 2150
    slice_point: 2200
    slice_point: 2250
    slice_point: 2300
    slice_point: 2350
  }
}
layer {
  name: "ip_s1/cifar2"
  type: "InnerProduct"
  bottom: "slice_s1/cifar2"
  top: "hash_s1/cifar2"
  param {
    name: "ip_1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s1/cifar2"
  type: "Sigmoid"
  bottom: "hash_s1/cifar2"
  top: "hash_s1/cifar2"
}

layer {
  name: "ip_s2/cifar2"
  type: "InnerProduct"
  bottom: "slice_s2/cifar2"
  top: "hash_s2/cifar2"
  param {
    name: "ip_2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s2/cifar2"
  type: "Sigmoid"
  bottom: "hash_s2/cifar2"
  top: "hash_s2/cifar2"
}

layer {
  name: "ip_s3/cifar2"
  type: "InnerProduct"
  bottom: "slice_s3/cifar2"
  top: "hash_s3/cifar2"
  param {
    name: "ip_3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_3_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s3/cifar2"
  type: "Sigmoid"
  bottom: "hash_s3/cifar2"
  top: "hash_s3/cifar2"
}

layer {
  name: "ip_s4/cifar2"
  type: "InnerProduct"
  bottom: "slice_s4/cifar2"
  top: "hash_s4/cifar2"
  param {
    name: "ip_4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_4_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s4/cifar2"
  type: "Sigmoid"
  bottom: "hash_s4/cifar2"
  top: "hash_s4/cifar2"
}

layer {
  name: "ip_s5/cifar2"
  type: "InnerProduct"
  bottom: "slice_s5/cifar2"
  top: "hash_s5/cifar2"
  param {
    name: "ip_5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_5_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s5/cifar2"
  type: "Sigmoid"
  bottom: "hash_s5/cifar2"
  top: "hash_s5/cifar2"
}

layer {
  name: "ip_s6/cifar2"
  type: "InnerProduct"
  bottom: "slice_s6/cifar2"
  top: "hash_s6/cifar2"
  param {
    name: "ip_6_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_6_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s6/cifar2"
  type: "Sigmoid"
  bottom: "hash_s6/cifar2"
  top: "hash_s6/cifar2"
}

layer {
  name: "ip_s7/cifar2"
  type: "InnerProduct"
  bottom: "slice_s7/cifar2"
  top: "hash_s7/cifar2"
  param {
    name: "ip_7_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_7_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s7/cifar2"
  type: "Sigmoid"
  bottom: "hash_s7/cifar2"
  top: "hash_s7/cifar2"
}

layer {
  name: "ip_s8/cifar2"
  type: "InnerProduct"
  bottom: "slice_s8/cifar2"
  top: "hash_s8/cifar2"
  param {
    name: "ip_8_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_8_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s8/cifar2"
  type: "Sigmoid"
  bottom: "hash_s8/cifar2"
  top: "hash_s8/cifar2"
}

layer {
  name: "ip_s9/cifar2"
  type: "InnerProduct"
  bottom: "slice_s9/cifar2"
  top: "hash_s9/cifar2"
  param {
    name: "ip_9_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_9_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s9/cifar2"
  type: "Sigmoid"
  bottom: "hash_s9/cifar2"
  top: "hash_s9/cifar2"
}

layer {
  name: "ip_s10/cifar2"
  type: "InnerProduct"
  bottom: "slice_s10/cifar2"
  top: "hash_s10/cifar2"
  param {
    name: "ip_10_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_10_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s10/cifar2"
  type: "Sigmoid"
  bottom: "hash_s10/cifar2"
  top: "hash_s10/cifar2"
}

layer {
  name: "ip_s11/cifar2"
  type: "InnerProduct"
  bottom: "slice_s11/cifar2"
  top: "hash_s11/cifar2"
  param {
    name: "ip_11_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_11_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s11/cifar2"
  type: "Sigmoid"
  bottom: "hash_s11/cifar2"
  top: "hash_s11/cifar2"
}

layer {
  name: "ip_s12/cifar2"
  type: "InnerProduct"
  bottom: "slice_s12/cifar2"
  top: "hash_s12/cifar2"
  param {
    name: "ip_12_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_12_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s12/cifar2"
  type: "Sigmoid"
  bottom: "hash_s12/cifar2"
  top: "hash_s12/cifar2"
}

layer {
  name: "ip_s13/cifar2"
  type: "InnerProduct"
  bottom: "slice_s13/cifar2"
  top: "hash_s13/cifar2"
  param {
    name: "ip_13_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_13_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s13/cifar2"
  type: "Sigmoid"
  bottom: "hash_s13/cifar2"
  top: "hash_s13/cifar2"
}

layer {
  name: "ip_s14/cifar2"
  type: "InnerProduct"
  bottom: "slice_s14/cifar2"
  top: "hash_s14/cifar2"
  param {
    name: "ip_14_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_14_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s14/cifar2"
  type: "Sigmoid"
  bottom: "hash_s14/cifar2"
  top: "hash_s14/cifar2"
}

layer {
  name: "ip_s15/cifar2"
  type: "InnerProduct"
  bottom: "slice_s15/cifar2"
  top: "hash_s15/cifar2"
  param {
    name: "ip_15_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_15_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s15/cifar2"
  type: "Sigmoid"
  bottom: "hash_s15/cifar2"
  top: "hash_s15/cifar2"
}

layer {
  name: "ip_s16/cifar2"
  type: "InnerProduct"
  bottom: "slice_s16/cifar2"
  top: "hash_s16/cifar2"
  param {
    name: "ip_16_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_16_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s16/cifar2"
  type: "Sigmoid"
  bottom: "hash_s16/cifar2"
  top: "hash_s16/cifar2"
}

layer {
  name: "ip_s17/cifar2"
  type: "InnerProduct"
  bottom: "slice_s17/cifar2"
  top: "hash_s17/cifar2"
  param {
    name: "ip_17_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "ip_17_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "sigmoid_s17/cifar2"
  type: "Sigmoid"
  bottom: "hash_s17/cifar2"
  top: "hash_s17/cifar2"
}

layer {
  name: "ip_s18/cifar2"
